
#                    _ooOoo_
#                   o8888888o
#                   88" . "88
#                   (| -_- |)
#                    O\ = /O
#                ____/`---'\____
#              .   ' \\| |// `.
#               / \\||| : |||// \
#             / _||||| -:- |||||- \
#               | | \\\ - /// | |
#             | \_| ''\---/'' | |
#              \ .-\__ `-` ___/-. /
#           ___`. .' /--.--\ `. . __
#        ."" '< `.___\_<|>_/___.' >'"".
#       | | : `- \`.;`\ _ /`;.`/ - ` : | |
#         \ \ `-. \_ __\ /__ _/ .-` / /
# ======`-.____`-.___\_____/___.-`____.-'======
#                    `=---='
#
# .............................................
#          佛祖保佑             永无BUG
#  佛曰:
#          写字楼里写字间，写字间里程序员；
#          程序人员写程序，又拿程序换酒钱。
#          酒醒只在网上坐，酒醉还来网下眠；
#          酒醉酒醒日复日，网上网下年复年。
#          但愿老死电脑间，不愿鞠躬老板前；
#          奔驰宝马贵者趣，公交自行程序员。
#          别人笑我忒疯癫，我笑自己命太贱；
#          不见满街漂亮妹，哪个归得程序员？

import pymysql
#链接数据库
db = pymysql.connect(host="127.0.0.1", user= "root", password = "!QAZ2wsx", port = 3307, database = "test", charset="utf8")

#创建游标
cur = db.cursor()

#准备sql
# sql = "insert into person(name,age,phone,address,class,fen) values('王五',20,100086,111,1,90)"  插入
sql = "select * from person"
try:
    #执行sql
    cur.execute(sql)

    #提交事务,写入硬盘
    db.commit()
    print("sql执行完成")
except Exception:
    #回滚
    print("sql有错误，正在执行回滚操作")
    db.rollback()
    print("回滚执行完成")
db.close()
