
#                    _ooOoo_
#                   o8888888o
#                   88" . "88
#                   (| -_- |)
#                    O\ = /O
#                ____/`---'\____
#              .   ' \\| |// `.
#               / \\||| : |||// \
#             / _||||| -:- |||||- \
#               | | \\\ - /// | |
#             | \_| ''\---/'' | |
#              \ .-\__ `-` ___/-. /
#           ___`. .' /--.--\ `. . __
#        ."" '< `.___\_<|>_/___.' >'"".
#       | | : `- \`.;`\ _ /`;.`/ - ` : | |
#         \ \ `-. \_ __\ /__ _/ .-` / /
# ======`-.____`-.___\_____/___.-`____.-'======
#                    `=---='
#
# .............................................
#          佛祖保佑             永无BUG
#  佛曰:
#          写字楼里写字间，写字间里程序员；
#          程序人员写程序，又拿程序换酒钱。
#          酒醒只在网上坐，酒醉还来网下眠；
#          酒醉酒醒日复日，网上网下年复年。
#          但愿老死电脑间，不愿鞠躬老板前；
#          奔驰宝马贵者趣，公交自行程序员。
#          别人笑我忒疯癫，我笑自己命太贱；
#          不见满街漂亮妹，哪个归得程序员？
import pickle
#将数据转换成bytes类型
list = ["张三","lisi",1,2,3,4]
a = pickle.dumps(list)
with open("一个文件.txt" ,"wb") as f :
    f.write(a)
#将bytes类型还原成数据
b = b'\x80\x03]q\x00(X\x06\x00\x00\x00\xe5\xbc\xa0\xe4\xb8\x89q\x01X\x04\x00\x00\x00lisiq\x02K\x01K\x02K\x03K\x04e.'
#print(pickle.loads(b))
with open("一个文件.txt" ,"rb") as f :
    print(pickle.loads(f.readline()))
