
#                    _ooOoo_
#                   o8888888o
#                   88" . "88
#                   (| -_- |)
#                    O\ = /O
#                ____/`---'\____
#              .   ' \\| |// `.
#               / \\||| : |||// \
#             / _||||| -:- |||||- \
#               | | \\\ - /// | |
#             | \_| ''\---/'' | |
#              \ .-\__ `-` ___/-. /
#           ___`. .' /--.--\ `. . __
#        ."" '< `.___\_<|>_/___.' >'"".
#       | | : `- \`.;`\ _ /`;.`/ - ` : | |
#         \ \ `-. \_ __\ /__ _/ .-` / /
# ======`-.____`-.___\_____/___.-`____.-'======
#                    `=---='
#
# .............................................
#          佛祖保佑             永无BUG
#  佛曰:
#          写字楼里写字间，写字间里程序员；
#          程序人员写程序，又拿程序换酒钱。
#          酒醒只在网上坐，酒醉还来网下眠；
#          酒醉酒醒日复日，网上网下年复年。
#          但愿老死电脑间，不愿鞠躬老板前；
#          奔驰宝马贵者趣，公交自行程序员。
#          别人笑我忒疯癫，我笑自己命太贱；
#          不见满街漂亮妹，哪个归得程序员？

def eat():
    print("做饭")
    print("炒菜")
    print("吃饭")


def phone_number():
    number_input = input("请输入你的电话号码：")
    number = number_input.strip()
    return number[-4::1]

#ret = phone_number()

def number():
    a = int(input(">>>>>>"))
    b = int(input(">>>>>>>"))
    if a > b:
        return a
    else:
        return b

# ret = number()
# print(ret)
# number()

#函数得参数
    #形参：在声明函数得时候，在括号中写的“变量”，接收外面传递进来得参数
    #实参：调用函数得时候，传递给函数得参数
        #位置参数：
        #关键字参数：
        #混合参数：关键字参数写在位置参数得后面


    #形参和实参得数量必须对应

def num(a,b):
    return a + b
ret = num(1,2)
print(ret)


