
#                    _ooOoo_
#                   o8888888o
#                   88" . "88
#                   (| -_- |)
#                    O\ = /O
#                ____/`---'\____
#              .   ' \\| |// `.
#               / \\||| : |||// \
#             / _||||| -:- |||||- \
#               | | \\\ - /// | |
#             | \_| ''\---/'' | |
#              \ .-\__ `-` ___/-. /
#           ___`. .' /--.--\ `. . __
#        ."" '< `.___\_<|>_/___.' >'"".
#       | | : `- \`.;`\ _ /`;.`/ - ` : | |
#         \ \ `-. \_ __\ /__ _/ .-` / /
# ======`-.____`-.___\_____/___.-`____.-'======
#                    `=---='
#
# .............................................
#          佛祖保佑             永无BUG
#  佛曰:
#          写字楼里写字间，写字间里程序员；
#          程序人员写程序，又拿程序换酒钱。
#          酒醒只在网上坐，酒醉还来网下眠；
#          酒醉酒醒日复日，网上网下年复年。
#          但愿老死电脑间，不愿鞠躬老板前；
#          奔驰宝马贵者趣，公交自行程序员。
#          别人笑我忒疯癫，我笑自己命太贱；
#          不见满街漂亮妹，哪个归得程序员？

f = open("1.txt","a+",encoding="utf-8")
f.write("\n张三，李四，王五")
print(f.readline())

f = open("1.jpeg","rb")
f1 = open(r"C:\Users\17310\Desktop/1.jpeg","wb")
f1.write(f.read())
f1.close()
f.close()


# 文件修改
#     创建一个源文件的副本，读取内容到内存，在内存中修改文件写入到副本
#     删除源文件
#     把副本文件名改成源文件的名字
import os
with open("1.txt","r",encoding="utf-8") as f,open("1.txt.back","a",encoding="utf-8") as f1:
    #读取文件中内容
    content = f.read()
    #把文件中的内容读取到内存替换相关内容
    f1.write(content.replace("zhangsan","张三"))
#删除源文件
os.remove("1.txt")
#把备份文件的名字替换成源文件的文件名
os.rename("1.txt.back","1.txt")
###
