
#                    _ooOoo_
#                   o8888888o
#                   88" . "88
#                   (| -_- |)
#                    O\ = /O
#                ____/`---'\____
#              .   ' \\| |// `.
#               / \\||| : |||// \
#             / _||||| -:- |||||- \
#               | | \\\ - /// | |
#             | \_| ''\---/'' | |
#              \ .-\__ `-` ___/-. /
#           ___`. .' /--.--\ `. . __
#        ."" '< `.___\_<|>_/___.' >'"".
#       | | : `- \`.;`\ _ /`;.`/ - ` : | |
#         \ \ `-. \_ __\ /__ _/ .-` / /
# ======`-.____`-.___\_____/___.-`____.-'======
#                    `=---='
#
# .............................................
#          佛祖保佑             永无BUG
#  佛曰:
#          写字楼里写字间，写字间里程序员；
#          程序人员写程序，又拿程序换酒钱。
#          酒醒只在网上坐，酒醉还来网下眠；
#          酒醉酒醒日复日，网上网下年复年。
#          但愿老死电脑间，不愿鞠躬老板前；
#          奔驰宝马贵者趣，公交自行程序员。
#          别人笑我忒疯癫，我笑自己命太贱；
#          不见满街漂亮妹，哪个归得程序员？

'''
1、用print打印出下⾯面内容： 1 ​ 文能提笔安天，武能马上定乾坤，心存谋略何人胜，古今英雄唯是君。
'''

print("文能提笔安天下\n无能马上定乾坤\n心存谋略何人胜\n古今英雄唯使君")
'''
2. 提⽰⽤用户输⼊入他的年年龄, 程序进⾏行行判断.
 '''

age = int(input("请输入你的年龄："))
if age < 10:
    print("小屁孩")
elif age < 20:
    print("青春期叛逆的小屁孩")
elif age <  30:
    print("开始定性，开始混社会的小屁孩")
elif age < 40:
    print("老大不小了，赶紧结婚生个小屁孩")
elif age < 50:
    print("家里有个不听话的小屁孩")
elif age < 60:
    print("自己马上变成不停话的老屁孩")
elif age < 70:
    print("活着还不错的老屁孩")
elif age < 90 and age > 70:
    print("人生就快结束的老屁孩")
else:
    print("再见了，这个世界")
'''
求1-100的所有数的和
'''

count = 0
tmp = 0
while count < 101:
    tmp = tmp + count
    count+= 1
print(tmp)
'''
输出1--100内所有的奇数
'''
count = 0
while count < 101:
    if count % 2 != 0:
        print(count)
    count+=1
'''
输出1--100内所有的偶数
'''

count = 0
while count < 101:
    if count % 2 == 0:
        print(count)
    count+=1

'''
求1-2+3-4+5 ... 99的所有数的和.  提示: 使⽤用循环, 每次循环都把上⼀一次计算的结果累加在⼀一个变量量⾥里里.
'''

count = 0
tmp = 0
while count <100:
    if count % 2 == 0:
        tmp = tmp - count
    else:
        tmp = tmp + count
    count+=1
print(tmp)

'''
计算361+362+363+…+460 = ? 
'''
count = 0
tmp = 361
while count < 101:
    tmp = tmp + count
    count+= 1
print(tmp)