
#                    _ooOoo_
#                   o8888888o
#                   88" . "88
#                   (| -_- |)
#                    O\ = /O
#                ____/`---'\____
#              .   ' \\| |// `.
#               / \\||| : |||// \
#             / _||||| -:- |||||- \
#               | | \\\ - /// | |
#             | \_| ''\---/'' | |
#              \ .-\__ `-` ___/-. /
#           ___`. .' /--.--\ `. . __
#        ."" '< `.___\_<|>_/___.' >'"".
#       | | : `- \`.;`\ _ /`;.`/ - ` : | |
#         \ \ `-. \_ __\ /__ _/ .-` / /
# ======`-.____`-.___\_____/___.-`____.-'======
#                    `=---='
#
# .............................................
#          佛祖保佑             永无BUG
#  佛曰:
#          写字楼里写字间，写字间里程序员；
#          程序人员写程序，又拿程序换酒钱。
#          酒醒只在网上坐，酒醉还来网下眠；
#          酒醉酒醒日复日，网上网下年复年。
#          但愿老死电脑间，不愿鞠躬老板前；
#          奔驰宝马贵者趣，公交自行程序员。
#          别人笑我忒疯癫，我笑自己命太贱；
#          不见满街漂亮妹，哪个归得程序员？


'''
程序会随机产⽣生⼀一个随机数. 让⽤用户去猜. 如果猜对了了, 结束游戏, 并提示: "恭喜你猜对了了". 如果猜⼤大了了.
提示: "猜⼤大 了了", 如果猜⼩小了了, 提示: "猜⼩小了了"
基本要求:⽤用户能⼀一直猜. 猜对为⽌止.
升级要求:⽤用户每次猜数都要缩⼩小范围. 并提示给⽤用户
'''

import random
number = random.randint(1,100)
print(number)
while True:
    guess = int(input(f"请输入您猜的数字"))
    if guess == number:
        print("恭喜你，猜对了")
        break
    elif guess > number:
        print("对不起，猜大了")
    else:
        print("对不起，猜小了")

'''
现给出⼀一个⽤用户账户的⽤用户名和密码. 请模拟⽤用户登录过程
'''

username = "Alex"
userpassword = "123456"
count = 1
while True:
    name = input("请输入您的账号：")
    password = input("请输入您的密码：")
    if name == username and password ==userpassword:
        print(f"恭喜你登陆成功，登陆了{count}次")
        break
    else:
        print("您的账号或密码输入错误")
    count+=1

#升级
username = "Alex"
userpassword = "123456"
count = 0
while count < 3:
    name = input("请输入您的账号：")
    password = input("请输入您的密码：")
    if username == name and password == userpassword:
        print("恭喜你，登陆成功")
    else:
        print(f"登陆失败，你还有{3-count-1}次机会")
    count+=1
