
#                    _ooOoo_
#                   o8888888o
#                   88" . "88
#                   (| -_- |)
#                    O\ = /O
#                ____/`---'\____
#              .   ' \\| |// `.
#               / \\||| : |||// \
#             / _||||| -:- |||||- \
#               | | \\\ - /// | |
#             | \_| ''\---/'' | |
#              \ .-\__ `-` ___/-. /
#           ___`. .' /--.--\ `. . __
#        ."" '< `.___\_<|>_/___.' >'"".
#       | | : `- \`.;`\ _ /`;.`/ - ` : | |
#         \ \ `-. \_ __\ /__ _/ .-` / /
# ======`-.____`-.___\_____/___.-`____.-'======
#                    `=---='
#
# .............................................
#          佛祖保佑             永无BUG
#  佛曰:
#          写字楼里写字间，写字间里程序员；
#          程序人员写程序，又拿程序换酒钱。
#          酒醒只在网上坐，酒醉还来网下眠；
#          酒醉酒醒日复日，网上网下年复年。
#          但愿老死电脑间，不愿鞠躬老板前；
#          奔驰宝马贵者趣，公交自行程序员。
#          别人笑我忒疯癫，我笑自己命太贱；
#          不见满街漂亮妹，哪个归得程序员？

# a = int(input("请输入a得值："))
# b = int(input("请输入b得值："))
# if a > b:
#     print(a)
# else:
#     print(b)

# salary = int(input("请输入你的工资："))
# if salary > 12000:
#     print("买手机")
# elif salary > 8000:
#     print("大保健")
# elif salary > 6000:
#     print("小保健")
# else:
#     print("洗个澡")

name = "zhangsan"
passwd = "1234"
uname = input("请输入账号：")
upasswd = input("请输入密码：")
if name == uname and passwd == upasswd:
    print("登陆成功")
else:
    print("账号或密码错误")